Raw-wrk-files/run-3/query/yaf-raw/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Tue Oct 22 00:25:17 PDT 2013

  System load:  0.26               Processes:           120
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/bench/raw/db?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/bench/raw/db?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms  108.60us   1.50ms   70.13%
    Req/Sec     1.16k    72.12     1.44k    91.40%
  43799 requests in 5.00s, 11.30MB read
Requests/sec:   8758.95
Transfer/sec:      2.26MB

---------------------------------------------------------
 Running Warmup yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.63ms   11.07ms 117.95ms   74.32%
    Req/Sec     1.85k   237.75     4.20k    85.88%
  220219 requests in 15.00s, 56.81MB read
Requests/sec:  14680.03
Transfer/sec:      3.79MB

---------------------------------------------------------
 Queries: 1 for yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.02ms    9.69ms 139.46ms   70.90%
    Req/Sec     2.07k   328.94     5.30k    78.69%
  239855 requests in 15.00s, 53.69MB read
Requests/sec:  15988.93
Transfer/sec:      3.58MB

---------------------------------------------------------
 Queries: 5 for yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.13ms   19.25ms 603.72ms   88.81%
    Req/Sec     1.54k   188.93     3.29k    74.93%
  182005 requests in 15.00s, 65.58MB read
Requests/sec:  12132.06
Transfer/sec:      4.37MB

---------------------------------------------------------
 Queries: 10 for yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.22ms   40.11ms   1.54s    93.39%
    Req/Sec     1.20k   130.71     1.63k    74.47%
  143084 requests in 15.00s, 76.10MB read
Requests/sec:   9538.14
Transfer/sec:      5.07MB

---------------------------------------------------------
 Queries: 15 for yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.12ms   58.52ms   1.71s    95.62%
    Req/Sec     0.97k   129.31     1.68k    73.39%
  116196 requests in 15.00s, 81.62MB read
Requests/sec:   7745.92
Transfer/sec:      5.44MB

---------------------------------------------------------
 Queries: 20 for yaf-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/bench/raw/db?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/bench/raw/db?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.76ms   55.85ms   1.03s    93.51%
    Req/Sec   755.10     86.81     1.56k    78.67%
  90167 requests in 15.00s, 78.72MB read
Requests/sec:   6009.86
Transfer/sec:      5.25MB